// Завдання 1: Цикл while
// Напишіть програму, яка використовує цикл while для виведення чисел від 1 до 10.

let i = 1;
while (i <= 10) {
  console.log(i);
  i++;
}
console.log("------------------------");

// Завдання 2: Цикл do...while
// Напишіть програму, яка використовує цикл do...while для виведення чисел від 10 до 1.

let j = 10;
do {
  console.log(j);
  j--;
} while (j >= 1);
console.log("------------------------");

// Завдання 3: Цикл for
// Напишіть програму, яка використовує цикл for для виведення парних чисел від 2 до 20

for (let i = 2; i <= 20; i += 2) {
    console.log(i);
}
console.log("------------------------");

// Завдання 4: Вкладений цикл
// Напишіть програму, яка використовує вкладений цикли for для виведення таблиці множення від 1 до 5.

for (let i = 1; i <= 5; i++) {
    for (let j = 1; j <= 5; j++) {
      console.log(`${i} x ${j} = ${i * j}`);
    }
    console.log("---");
}
console.log("------------------------");

// Завдання 5: Цикл з використанням continue
// Напишіть програму, яка використовує цикл for для виведення чисел від 1 до 10, але пропускає числа, що діляться на 3 без остачі.

for (let i = 1; i <= 10; i++) {
    if (i % 3 === 0) {
      continue;
    }
    console.log(i);
  }
console.log("------------------------");

// Завдання 6: Цикл з використанням break
// Напишіть програму, яка використовує цикл while для виведення чисел від 1 до 10, але зупиняється, коли число дорівнює 7

let k = 1;
while (k <= 10) {
  console.log(k);
  if (k === 7) {
    break;
  }
  k++;
}
